public class paradigm {
    public static void main(String[] args) {
        //프로그래밍 방식에도 패러다임이 있다!

        //프로그래밍을 할 때 가지는 체계, 관점, 틀

        // 프로그래밍 => 명령형 => 객체지향(flexible format, 자유도가 높음), 절차지향(fixed format, 속도가 빠름)
        // 프로그래밍 => 선언형 => 함수형


        //객체지향 프로그래밍이란? 
        // component를 만들고 component를 조립하는것
        // 정수형 데이터를 담을 수 있는 num을 선언하세요!
        // int num = 0;

        // 이제부터는 사용자정의 데이터를 만든다 
        // 사람 데이터 1개를 담을 수 있는 person을 선언하세요!
        // 사람 데이터 =>

        // 객체란? 
        // 여러가지 데이터들이 모여 있는 복잡한 자료형
        // 내가 만드는 나만의 새로운 자료형
        // 내가 새롭게 만드는 나만의 도구
        // ex)Scanner, Random, Math

        // 클래스와 객체? 
        // class vs object
        
        // 클래스(class) 
        // => 실제 object를 제작하기 전 설계하는 도면
        
        // 객체(object)
        // => 클래스를 기반으로 실제로 메모리에 할당되는 것
        // 하나의 클래스로 서로 다른 객체를 찍어낼 수 있다.

        //Field(속성) -> Data // Method(행동,기능) -> Logic
        //Field: 이름, 키, 나이, 성별, 머리색, 눈동자
        //Method: 걷다, 먹다, 자다, 말하다, 싸우다, 생각하다

        //동일한 설계도면 => 어떤 값이 들어가냐에 따라 서로 다른 값을 가진 객체 생성가능 => 하나의 도면

        //★★★객체지향프로그래밍의 특징
        // 1.캡슐화(Encapsulation) => 정보은닉
        // 2.상속(Inheritance)
        // 3.추상화(Abstract)
        // 4.다형성(Polymorphism)


        // 캡슐화(Encapsulation) 정리 
        // 장난감 => Field(Data) 
        // 설명서 => Method(Logic)
        // 데이터 2개를 넣고 닫아버림 => 정보은닉
        // Scanner, Random, Arrays, Math 등
        // 관련된 필드(속성)와 메소드(기능)를 하나로 묶고, 실제 구현 내용을 외부로부터 감추는 기법(정보은닉)
        // 만일 상황(타인이 외부에서 조작)을 대비해서 특정 속성이나 메소드를 사용자가 조작할 수 없도록 숨겨놓은것.

        // 상속(Inheritance)
        // 전자제품(전원기능)=>통신기기(통화기능)=>휴대폰(카메라,게임기능)=>아이폰(Apple제품 연동기능)
        //iphone객체 (상속받은 기능): 전원기능,통화기능,카메라,게임기능 // (고유기능)Apple제품 연동기능
        // 이미 작성된 클래스(상위클래스)의 특성을 그대로 이어받아 새로운 클래스(하위클래스)를 생성하는 기법
        

        // 추상화(Abstract)
        // 객체에서 공동된 속성과 행위를 추출하는 기법
        // 상세한 정보는 무시하고 필요한 정보들만 간추려서 구성
        // 코드 상에서 구현(로직)부분을 제외한 오직 선언 부분만을 설계

        // 다형성(polymorphism)
        // 다양한 자료형으로 표현할 수 있다.
        // 정해진 규격만 맞다면 다양한 곳에서 기능 수행가능
        // 사전적 의미"다양한 형태로 나타날 수 있는 능력'
        // 같은 기능(메소드)를 호출하더라도 객체에 따라 다르게 동작하는 것
        // 상위 클래스의 동작을 하위 클래스... 중략

        // 객체지향 프로그래밍의 장점
        // 유지보수가 용이하다. 
        // 직관적인 코드 분석이 가능하다

        // 클래스 설계해보기!
        










    }
}
