public class basic {
    // 1. 객체지향 프로그래밍 특징
    // 추상화(Abstract),캡슐화(encapsulation), 상속, 다형성(polymorphism)
    // 추상화 복잡한 시스템에서 중요한 정보만을 추출하여 핵심적인 부분만 나타내는 개념으로 프로그램 설계를 단순하고 효율적으로 만든다.
    // 캡슐화 객체의 데이터와 메서드를 하나로 묶고 외부에서 객체 내부의 데이터에 직접 접근하지 못하도록 제한하여 데이터 무결성을 보호하는 특성
    // 생속 기존의 클래스의 속성과 기능을 새로운 클래스가 물려받아 재사용하고 확장할 수 있는 기능
    // 다형성 하나의 인터페이스나 메서드가 여러형태로 동작할 수 있도록 하는 능력으로 코드의 유연성과 확장성을 돕는다.

    // 두발자전거(기존클래스)를 발명하고 설계도면이 있다면 보조바퀴 설계도만 추가하면 된다.
    // 상속을 통해서 다른 사람이 만들어놓은 두발자전거를 그대로 사용한다.

    // 기본캐릭터 => 1차전직 => 2차전직 
    // 부모 클래스 = parent super class
    // 장점 1. 유지보수 용이 
}
