public class Ex02Naming {
    public static void main(String[] args) {
        
        // ★★★변수명 작성 절대 규칙★★★!
        // 1. 키워드 사용 불가 --> eclipse 작성 시 새깔이 변한다면 키워드다.
        // 2. 대소문자를 구분하고 길이에 제한이 없다.--> 변수명은 의미전달이 중요하다! a,b,c,d 이렇게 짓지말기!
        // 3. 숫자로 시작할 수 없다. --> 숫자는 값으로 인식한다.
        // 4. 특수문자는 _와 $만 가능하다.

        // 자바 개발자에게 권장하는 규칙들
        // 1. 변수 시작은 소문자로!
        // 2. 여러단어가 이어지는 경우에는 이어지는 단어의 첫 글자는 대문자로! (ex. studentName, userAge)--> 카멜표기법(Camel Case, Snake Case)
        
    }
}
